src/VirtualClient/VirtualClient.Actions.UnitTests/Examples/Memtier/Memtier_Memcached_Results_5.txt
4         Threads
1         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets         4892.38          ---          ---         2.60820         2.79900         3.88700         4.41500         7.00700        28.15900       333.90
Gets        44031.14     44031.14         0.00         2.58644         2.73500         3.85500         4.35100         6.94300        28.03100      3774.33
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals      48923.52     44031.14         0.00         2.58862         2.73500         3.85500         4.35100         6.94300        28.03100      4108.23


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.063        0.000
SET       0.367        5.000
SET       0.551       10.000
SET       0.855       15.000
SET       1.231       20.000
SET       1.607       25.000
SET       1.943       30.000
SET       2.223       35.000
SET       2.447       40.000
SET       2.639       45.000
SET       2.799       50.000
SET       2.863       52.500
SET       2.927       55.000
SET       2.991       57.500
SET       3.039       60.000
SET       3.087       62.500
SET       3.119       65.000
SET       3.167       67.500
SET       3.199       70.000
SET       3.247       72.500
SET       3.311       75.000
SET       3.343       76.250
SET       3.375       77.500
SET       3.423       78.750
SET       3.471       80.000
SET       3.519       81.250
SET       3.567       82.500
SET       3.615       83.750
SET       3.663       85.000
SET       3.727       86.250
SET       3.775       87.500
SET       3.791       88.125
SET       3.823       88.750
SET       3.855       89.375
SET       3.887       90.000
SET       3.935       90.625
SET       3.967       91.250
SET       4.015       91.875
SET       4.079       92.500
SET       4.159       93.125
SET       4.223       93.750
SET       4.255       94.062
SET       4.319       94.375
SET       4.351       94.688
SET       4.415       95.000
SET       4.447       95.312
SET       4.543       95.625
SET       4.607       95.938
SET       4.703       96.250
SET       4.799       96.562
SET       4.927       96.875
SET       5.023       97.031
SET       5.119       97.188
SET       5.183       97.344
SET       5.311       97.500
SET       5.407       97.656
SET       5.567       97.812
SET       5.695       97.969
SET       5.823       98.125
SET       5.983       98.281
SET       6.175       98.438
SET       6.271       98.516
SET       6.399       98.594
SET       6.495       98.672
SET       6.591       98.750
SET       6.719       98.828
SET       6.847       98.906
SET       6.975       98.984
SET       7.167       99.062
SET       7.327       99.141
SET       7.519       99.219
SET       7.647       99.258
SET       7.743       99.297
SET       7.903       99.336
SET       8.031       99.375
SET       8.191       99.414
SET       8.383       99.453
SET       8.575       99.492
SET       8.831       99.531
SET       9.151       99.570
SET       9.407       99.609
SET       9.663       99.629
SET       9.919       99.648
SET      10.175       99.668
SET      10.559       99.688
SET      10.815       99.707
SET      11.391       99.727
SET      12.031       99.746
SET      12.799       99.766
SET      13.823       99.785
SET      15.871       99.805
SET      16.895       99.814
SET      18.303       99.824
SET      20.351       99.834
SET      22.143       99.844
SET      23.551       99.854
SET      25.087       99.863
SET      25.983       99.873
SET      27.007       99.883
SET      27.647       99.893
SET      28.287       99.902
SET      28.799       99.907
SET      29.055       99.912
SET      29.823       99.917
SET      30.207       99.922
SET      30.463       99.927
SET      30.975       99.932
SET      31.615       99.937
SET      32.127       99.941
SET      33.279       99.946
SET      34.047       99.951
SET      34.303       99.954
SET      34.559       99.956
SET      35.327       99.958
SET      35.839       99.961
SET      36.351       99.963
SET      37.631       99.966
SET      38.143       99.968
SET      38.655       99.971
SET      39.679       99.973
SET      40.191       99.976
SET      40.447       99.977
SET      40.703       99.978
SET      41.471       99.979
SET      41.727       99.980
SET      42.239       99.982
SET      42.495       99.983
SET      43.007       99.984
SET      43.263       99.985
SET      43.519       99.987
SET      44.031       99.988
SET      44.031       99.988
SET      44.031       99.989
SET      44.543       99.990
SET      45.055       99.990
SET      45.311       99.991
SET      45.567       99.991
SET      46.079       99.992
SET      46.847       99.993
SET      46.847       99.993
SET      47.103       99.994
SET      47.103       99.994
SET      47.103       99.995
SET      47.615       99.995
SET      48.127       99.995
SET      49.407       99.995
SET      49.663       99.996
SET      49.663       99.996
SET      49.919       99.996
SET      49.919       99.997
SET      51.967       99.997
SET      51.967       99.997
SET      51.967       99.997
SET      52.735       99.997
SET      52.735       99.998
SET      52.991       99.998
SET      52.991       99.998
SET      52.991       99.998
[...]
SET      53.503       99.998
SET      53.503       99.998
SET      53.503       99.999
SET      53.503       99.999
SET      55.039       99.999
SET      55.039      100.000
---
GET       0.055        0.000
GET       0.391        5.000
GET       0.639       10.000
GET       0.943       15.000
GET       1.287       20.000
GET       1.615       25.000
GET       1.911       30.000
GET       2.175       35.000
GET       2.383       40.000
GET       2.575       45.000
GET       2.735       50.000
GET       2.815       52.500
GET       2.879       55.000
GET       2.943       57.500
GET       2.991       60.000
GET       3.039       62.500
GET       3.087       65.000
GET       3.135       67.500
GET       3.183       70.000
GET       3.215       72.500
GET       3.279       75.000
GET       3.311       76.250
GET       3.343       77.500
GET       3.375       78.750
GET       3.423       80.000
GET       3.471       81.250
GET       3.519       82.500
GET       3.583       83.750
GET       3.631       85.000
GET       3.679       86.250
GET       3.743       87.500
GET       3.759       88.125
GET       3.791       88.750
GET       3.823       89.375
GET       3.855       90.000
GET       3.887       90.625
GET       3.935       91.250
GET       3.983       91.875
GET       4.031       92.500
GET       4.095       93.125
GET       4.159       93.750
GET       4.223       94.062
GET       4.255       94.375
GET       4.319       94.688
GET       4.351       95.000
GET       4.415       95.312
GET       4.479       95.625
GET       4.543       95.938
GET       4.639       96.250
GET       4.735       96.562
GET       4.863       96.875
GET       4.927       97.031
GET       5.023       97.188
GET       5.119       97.344
GET       5.215       97.500
GET       5.343       97.656
GET       5.471       97.812
GET       5.599       97.969
GET       5.759       98.125
GET       5.919       98.281
GET       6.079       98.438
GET       6.175       98.516
GET       6.303       98.594
GET       6.431       98.672
GET       6.527       98.750
GET       6.655       98.828
GET       6.783       98.906
GET       6.911       98.984
GET       7.071       99.062
GET       7.263       99.141
GET       7.455       99.219
GET       7.551       99.258
GET       7.679       99.297
GET       7.807       99.336
GET       7.967       99.375
GET       8.095       99.414
GET       8.255       99.453
GET       8.511       99.492
GET       8.703       99.531
GET       9.023       99.570
GET       9.343       99.609
GET       9.599       99.629
GET       9.855       99.648
GET      10.111       99.668
GET      10.495       99.688
GET      10.751       99.707
GET      11.263       99.727
GET      11.967       99.746
GET      12.415       99.766
GET      13.631       99.785
GET      15.615       99.805
GET      16.639       99.814
GET      17.663       99.824
GET      19.967       99.834
GET      21.887       99.844
GET      23.295       99.854
GET      24.959       99.863
GET      25.855       99.873
GET      26.751       99.883
GET      27.519       99.893
GET      28.159       99.902
GET      28.799       99.907
GET      29.055       99.912
GET      29.951       99.917
GET      30.207       99.922
GET      30.591       99.927
GET      30.975       99.932
GET      31.743       99.937
GET      32.255       99.941
GET      33.279       99.946
GET      34.047       99.951
GET      34.303       99.954
GET      34.559       99.956
GET      35.071       99.958
GET      35.839       99.961
GET      36.095       99.963
GET      37.119       99.966
GET      37.631       99.968
GET      38.399       99.971
GET      39.679       99.973
GET      39.935       99.976
GET      40.191       99.977
GET      40.703       99.978
GET      41.215       99.979
GET      41.471       99.980
GET      41.727       99.982
GET      42.495       99.983
GET      42.751       99.984
GET      43.007       99.985
GET      43.519       99.987
GET      43.775       99.988
GET      44.031       99.988
GET      44.031       99.989
GET      44.543       99.990
GET      44.799       99.990
GET      45.311       99.991
GET      45.311       99.991
GET      45.823       99.992
GET      46.847       99.993
GET      46.847       99.993
GET      47.103       99.994
GET      47.103       99.994
GET      47.103       99.995
GET      47.103       99.995
GET      47.615       99.995
GET      49.407       99.995
GET      49.663       99.996
GET      49.663       99.996
GET      49.919       99.996
GET      49.919       99.997
GET      49.919       99.997
GET      50.431       99.997
GET      51.967       99.997
GET      52.479       99.997
GET      52.735       99.998
GET      52.735       99.998
GET      52.735       99.998
[...]
GET      52.991       99.998
GET      52.991       99.998
GET      52.991       99.998
GET      52.991       99.999
GET      52.991       99.999
GET      53.503       99.999
GET      53.503       99.999
GET      53.759       99.999
GET      53.759       99.999
GET      55.039       99.999
GET      55.039      100.000
---
WAIT      0.000      100.000